### Indexing and merging two

#### References
1. Python for data analysis
2. Think stats: exploratory data analysis
3. https://pandas.pydata,org

#### Purpose
1. Work in the abstract (its good for the brain)
2. Keep up to date with changes in the library
3. Explore new ways of doing common tasks --- get better

In [1]:
import pandas as pd
import numpy as np

In [2]:
# create some data frames
index = ['a', 'b', 'c', 'd', 'e']
index_2 = ['f', 'g', 'h', 'i', 'j']
columns = ['bacon', 'eggs', 'ham', 'spam', 'hash']
columns_2 = ['toast', 'jelly', 'butter', 'wheat', 'white']
index_3 = ['k', 'l', 'm']
columns_3 = ['pancakes', 'waffles', 'crepes']
index_4 = pd.date_range('04/01/2017', periods=30, freq='D')
columns_4 = ['Waffle house', 'Dennys', 'Panera']
names = ['Sheila', 'Dave', 'Pat']
resto = columns_4


a = pd.DataFrame(np.random.randint(6, size=(5,5)), index=index, columns=columns)
b = pd.DataFrame(np.random.randint(4, size=(5,5)), index=index_2, columns=columns_2)
c = pd.DataFrame(np.random.randint(4, size=(3,3)), index=index_3, columns=columns_3)
d = pd.DataFrame(6 * np.random.random_sample((30, 3)) + 3.99, dtype='float64', index=index_4, columns=columns_4)
e = pd.DataFrame(np.random.choice(resto,(30,3)), columns = names)
d[columns_4]=d[columns_4].round(2)

In [3]:
print(a)
print(b)
print(c)
print(d)
print(e)

   bacon  eggs  ham  spam  hash
a      0     4    3     5     0
b      0     0    3     5     0
c      3     5    0     0     4
d      0     0    2     2     5
e      1     1    0     3     1
   toast  jelly  butter  wheat  white
f      1      3       3      1      1
g      1      1       3      1      1
h      2      0       0      1      2
i      1      3       3      0      1
j      2      1       2      2      1
   pancakes  waffles  crepes
k         1        2       3
l         3        0       2
m         3        3       0
            Waffle house  Dennys  Panera
2017-04-01          6.08    8.60    6.92
2017-04-02          9.23    4.70    7.71
2017-04-03          9.07    7.22    8.85
2017-04-04          4.19    6.01    9.74
2017-04-05          8.68    7.46    7.16
2017-04-06          5.65    9.16    9.11
2017-04-07          4.20    8.21    5.90
2017-04-08          8.14    9.69    8.45
2017-04-09          5.52    5.66    8.83
2017-04-10          5.04    6.98    4.91
2017-04-11          4.55    9.52    7.74
2017-04-12          9.48    8.02    4.28
2017-04-13          4.57    8.49    5.19
2017-04-14          9.33    8.82    9.83
2017-04-15          7.89    9.42    8.71
2017-04-16          5.86    7.90    6.89
2017-04-17          9.57    9.74    5.41
2017-04-18          6.31    7.28    7.60
2017-04-19          4.42    6.17    4.73
2017-04-20          6.02    7.13    6.77
2017-04-21          7.71    5.51    8.40
2017-04-22          9.78    7.15    4.01
2017-04-23          6.67    9.53    6.11
2017-04-24          5.56    7.40    5.62
2017-04-25          8.48    5.32    9.76
2017-04-26          9.19    8.52    9.29
2017-04-27          4.97    9.43    4.35
2017-04-28          8.40    9.35    4.51
2017-04-29          8.63    8.14    7.61
2017-04-30          5.84    6.32    8.90
          Sheila          Dave           Pat
0         Dennys  Waffle house        Panera
1         Dennys  Waffle house  Waffle house
2   Waffle house  Waffle house  Waffle house
3         Panera        Panera        Dennys
4         Dennys        Panera  Waffle house
5         Dennys        Dennys        Dennys
6         Dennys        Dennys        Panera
7         Panera  Waffle house  Waffle house
8         Dennys  Waffle house        Dennys
9         Dennys  Waffle house        Dennys
10        Panera        Panera  Waffle house
11  Waffle house  Waffle house        Dennys
12  Waffle house  Waffle house  Waffle house
13        Panera        Dennys        Panera
14        Dennys        Panera        Dennys
15        Panera        Dennys  Waffle house
16  Waffle house        Dennys  Waffle house
17  Waffle house  Waffle house        Panera
18        Panera  Waffle house        Panera
19        Panera        Panera        Panera
20  Waffle house        Dennys        Panera
21        Dennys  Waffle house        Panera
22        Panera  Waffle house  Waffle house
23        Dennys        Dennys  Waffle house
24        Panera  Waffle house        Panera
25        Panera        Dennys        Panera
26        Panera  Waffle house        Panera
27        Dennys  Waffle house        Panera
28        Panera  Waffle house  Waffle house
29        Dennys  Waffle house        Dennys

In [4]:
# switch the columns so that Dave = Pat and Pat = Sheila and Sheila = Dave
e.loc[:, ['Pat', 'Sheila', 'Dave']] = e[names].values

In [5]:
e.iloc[:4]

         Sheila          Dave           Pat
0  Waffle house        Panera        Dennys
1  Waffle house  Waffle house        Dennys
2  Waffle house  Waffle house  Waffle house
3        Panera        Dennys        Panera

In [6]:
# can acces columns as attributes
e_sheila, e_dave, e_pat = e.Sheila, e.Dave, e.Pat
e_dave[:4]

0          Panera
1    Waffle house
2    Waffle house
3          Dennys
Name: Dave, dtype: object

In [7]:
type(e_dave)

pandas.core.series.Series

In [8]:
# so that means all series slicing syntax works here
e_dave[::5]
# start from the back and get every fifth element

0           Panera
5           Dennys
10    Waffle house
15    Waffle house
20          Panera
25          Panera
Name: Dave, dtype: object

In [9]:
# get the whole thing in reverse
e_dave[::-1]
# notice the index value is valid, here we start at 29

29          Dennys
28    Waffle house
27          Panera
26          Panera
25          Panera
24          Panera
23    Waffle house
22    Waffle house
21          Panera
20          Panera
19          Panera
18          Panera
17          Panera
16    Waffle house
15    Waffle house
14          Dennys
13          Panera
12    Waffle house
11          Dennys
10    Waffle house
9           Dennys
8           Dennys
7     Waffle house
6           Panera
5           Dennys
4     Waffle house
3           Dennys
2     Waffle house
1     Waffle house
0           Panera
Name: Dave, dtype: object

In [10]:
# dave says that he ate at Waffle house on the third
e_dave[2] = "Waffle house"

In [11]:
e_dave[:5]
# changed from Dennys to Waffle house

0          Panera
1    Waffle house
2    Waffle house
3          Dennys
4    Waffle house
Name: Dave, dtype: object

In [12]:
# this works on data frames too
e[:3]

         Sheila          Dave           Pat
0  Waffle house        Panera        Dennys
1  Waffle house  Waffle house        Dennys
2  Waffle house  Waffle house  Waffle house

In [13]:
e[::5]

          Sheila          Dave           Pat
0   Waffle house        Panera        Dennys
5         Dennys        Dennys        Dennys
10        Panera  Waffle house        Panera
15        Dennys  Waffle house        Panera
20        Dennys        Panera  Waffle house
25        Dennys        Panera        Panera

In [14]:
# selection by label is the same
e['Dave'][:5]

0          Panera
1    Waffle house
2    Waffle house
3          Dennys
4    Waffle house
Name: Dave, dtype: object

In [15]:
# with dates it is a little different
# ---- > d.loc[2:7] this will throw an error
# TypeError: cannot do slice indexing on <class 'pandas.core.indexes.datetimes.DatetimeIndex'> 
# with these indexers [2] of <class 'int'>

In [16]:
# you need to use the value or a convertible 'like'string
d.loc['20170410': '20170414']
# notice the endpoint is included...

            Waffle house  Dennys  Panera
2017-04-10          5.04    6.98    4.91
2017-04-11          4.55    9.52    7.74
2017-04-12          9.48    8.02    4.28
2017-04-13          4.57    8.49    5.19
2017-04-14          9.33    8.82    9.83

In [17]:
# here we can slice with labels
b.loc['b':'d']
# returns empy

Empty DataFrame
Columns: [toast, jelly, butter, wheat, white]
Index: []

In [18]:
# whats in the index then
b.index.values

array(['f', 'g', 'h', 'i', 'j'], dtype=object)

In [19]:
# so do this:
b_index = b.index.values
b_index[3]

'i'

In [20]:
# use the list and pass your index range as a slice value
b.loc[b_index[2:4]]

   toast  jelly  butter  wheat  white
h      2      0       0      1      2
i      1      3       3      0      1

In [21]:
# these will come in handy
# yes we could have used the list to create the df
# but what if you don't have that list?
a_index = a.index.values
c_index = c.index.values

In [22]:
# so labels can be used just like integers(almost)
c.loc['k':]

   pancakes  waffles  crepes
k         1        2       3
l         3        0       2
m         3        3       0

In [23]:
#or
c.loc[:'m']

   pancakes  waffles  crepes
k         1        2       3
l         3        0       2
m         3        3       0

In [24]:
# grab a mix of rows:
a.loc['b':, 'ham':'hash']

   ham  spam  hash
b    3     5     0
c    0     0     4
d    2     2     5
e    0     3     1

In [25]:
# or 
a.loc['c':'e', 'ham':'spam']

   ham  spam
c    0     0
d    2     2
e    0     3

In [26]:
# cross section of one row
a.loc['d']

bacon    0
eggs     0
ham      2
spam     2
hash     5
Name: d, dtype: int64

In [27]:
# get a specific value:
# for example how much was spent at 'Waffle house' on April 13
d.loc['20170414', 'Waffle house']

9.33

In [28]:
# if you know the index number
d.iloc[13]['Waffle house']

9.33

In [29]:
d.loc['20170414']

Waffle house    9.33
Dennys          8.82
Panera          9.83
Name: 2017-04-14 00:00:00, dtype: float64

In [30]:
# return to iloc
e.iloc[:5]
# iloc is like numpy or python.... the upper bound is excluded

         Sheila          Dave           Pat
0  Waffle house        Panera        Dennys
1  Waffle house  Waffle house        Dennys
2  Waffle house  Waffle house  Waffle house
3        Panera        Dennys        Panera
4        Panera  Waffle house        Dennys

In [31]:
# get rows 11-18 for Dennys and panera
d.iloc[11:19, 1:]

            Dennys  Panera
2017-04-12    8.02    4.28
2017-04-13    8.49    5.19
2017-04-14    8.82    9.83
2017-04-15    9.42    8.71
2017-04-16    7.90    6.89
2017-04-17    9.74    5.41
2017-04-18    7.28    7.60
2017-04-19    6.17    4.73

In [32]:
# this will not work ---> d.iloc[11:19, resto[1:]]
# canont put a string indexer with iloc
# TypeError: cannot perform reduce with flexible type

#### Selection by callable

In [33]:
d.iloc[13:20, lambda q: [1,2]]

            Dennys  Panera
2017-04-14    8.82    9.83
2017-04-15    9.42    8.71
2017-04-16    7.90    6.89
2017-04-17    9.74    5.41
2017-04-18    7.28    7.60
2017-04-19    6.17    4.73
2017-04-20    7.13    6.77

In [34]:
d.loc['20170407':'20170413', lambda q: [resto[2]]]

            Panera
2017-04-07    5.90
2017-04-08    8.45
2017-04-09    8.83
2017-04-10    4.91
2017-04-11    7.74
2017-04-12    4.28
2017-04-13    5.19

In [35]:
# how much did sheila pay for breakfast on april 20th and where did she eat?
# so where everybody ate is given as a df in ascendo-ng order with no dates
# what was paid and what restauraunt is given by date

# we know this
cost = d.loc['20170420']
where = e.iloc[19, 0]
print(cost)
print(where)

Waffle house    6.02
Dennys          7.13
Panera          6.77
Name: 2017-04-20 00:00:00, dtype: float64
Panera

In [36]:
# so combined that would be
d.loc['20170420', e.iloc[19,0]]

6.77

In [37]:
rest = dict(zip(d.columns, np.arange(3)))

In [38]:
rest

{'Dennys': 1, 'Panera': 2, 'Waffle house': 0}

In [39]:
def get_cost(x,y):
    a = []
    for i, n in enumerate(list(e[x])):
        b = d.iloc[i, y[n]]
        a.append(b)
    return(a)
cost_sheila = get_cost('Sheila', rest)
cost_sheila[:5]

[6.08, 9.23, 9.07, 9.74, 7.16]

In [40]:
# okay so we can get the the location and the price for sheila
# but it is not in a df
# join dfs and see what that gives
e.index, d.index
# normally the len should match, and the data in e is given chronologically
# so we'ell check

(RangeIndex(start=0, stop=30, step=1),
 DatetimeIndex(['2017-04-01', '2017-04-02', '2017-04-03', '2017-04-04',
                '2017-04-05', '2017-04-06', '2017-04-07', '2017-04-08',
                '2017-04-09', '2017-04-10', '2017-04-11', '2017-04-12',
                '2017-04-13', '2017-04-14', '2017-04-15', '2017-04-16',
                '2017-04-17', '2017-04-18', '2017-04-19', '2017-04-20',
                '2017-04-21', '2017-04-22', '2017-04-23', '2017-04-24',
                '2017-04-25', '2017-04-26', '2017-04-27', '2017-04-28',
                '2017-04-29', '2017-04-30'],
               dtype='datetime64[ns]', freq='D'))

In [41]:
len(d.index), len(e.index)

(30, 30)

In [42]:
e_i = d.index
e_i

DatetimeIndex(['2017-04-01', '2017-04-02', '2017-04-03', '2017-04-04',
               '2017-04-05', '2017-04-06', '2017-04-07', '2017-04-08',
               '2017-04-09', '2017-04-10', '2017-04-11', '2017-04-12',
               '2017-04-13', '2017-04-14', '2017-04-15', '2017-04-16',
               '2017-04-17', '2017-04-18', '2017-04-19', '2017-04-20',
               '2017-04-21', '2017-04-22', '2017-04-23', '2017-04-24',
               '2017-04-25', '2017-04-26', '2017-04-27', '2017-04-28',
               '2017-04-29', '2017-04-30'],
              dtype='datetime64[ns]', freq='D')

In [43]:
e.set_index(e_i, inplace=True)
e.iloc[:5]

                  Sheila          Dave           Pat
2017-04-01  Waffle house        Panera        Dennys
2017-04-02  Waffle house  Waffle house        Dennys
2017-04-03  Waffle house  Waffle house  Waffle house
2017-04-04        Panera        Dennys        Panera
2017-04-05        Panera  Waffle house        Dennys

In [44]:
#okay so this should work
d_e = pd.concat([d,e], axis=1)
d_e.iloc[:10]

,Waffle house,Dennys,Panera,Sheila,Dave,Pat
2017-04-01,6.08,8.60,6.92,Waffle house,Panera,Dennys
2017-04-02,9.23,4.70,7.71,Waffle house,Waffle house,Dennys
2017-04-03,9.07,7.22,8.85,Waffle house,Waffle house,Waffle house
2017-04-04,4.19,6.01,9.74,Panera,Dennys,Panera
2017-04-05,8.68,7.46,7.16,Panera,Waffle house,Dennys
2017-04-06,5.65,9.16,9.11,Dennys,Dennys,Dennys
2017-04-07,4.20,8.21,5.90,Dennys,Panera,Dennys
2017-04-08,8.14,9.69,8.45,Waffle house,Waffle house,Panera
2017-04-09,5.52,5.66,8.83,Waffle house,Dennys,Dennys
2017-04-10,5.04,6.98,4.91,Waffle house,Dennys,Dennys

In [45]:
# so now set a value for the cost of sheilas breakfast
d_e['cost_sheila'] = cost_sheila

In [46]:
d_e.iloc[:10]

,Waffle house,Dennys,Panera,Sheila,Dave,Pat,cost_sheila
2017-04-01,6.08,8.60,6.92,Waffle house,Panera,Dennys,6.08
2017-04-02,9.23,4.70,7.71,Waffle house,Waffle house,Dennys,9.23
2017-04-03,9.07,7.22,8.85,Waffle house,Waffle house,Waffle house,9.07
2017-04-04,4.19,6.01,9.74,Panera,Dennys,Panera,9.74
2017-04-05,8.68,7.46,7.16,Panera,Waffle house,Dennys,7.16
2017-04-06,5.65,9.16,9.11,Dennys,Dennys,Dennys,9.16
2017-04-07,4.20,8.21,5.90,Dennys,Panera,Dennys,8.21
2017-04-08,8.14,9.69,8.45,Waffle house,Waffle house,Panera,8.14
2017-04-09,5.52,5.66,8.83,Waffle house,Dennys,Dennys,5.52
2017-04-10,5.04,6.98,4.91,Waffle house,Dennys,Dennys,5.04

In [47]:
# okay!